{"text": "10 years after Katrina made landfall, I have been hearing a lot about the storm. Some from people who lived through it, many of whom had a much worse experience than me. Also some from people who are just observing. I figure I should throw my voice into the crowd, if only so in 10 more years I can look back on what I thought today. This will not be as polished and poetic as much of what is out of there, just me trying to put some thoughts together. At the time of the storm I was 12, in seventh grade, and so my memories may be skewed, but I will present them as they are since reality is actually relatively unimportant in the way that we process life events.  My journey through Katrina Where was I?  When the storm hit my family was in Destin, FL (a common place to find New Orleanians), we had not evacuated, my father was riding in a triathlon (I imagine the sandestin triathlon). Originally, the computer models for the storm put it going through Destin, so we brought the dog with us, expecting that we would need to evacuate from Destin to Atlanta. Then the computer models began to shift westward, and it eventually became clear that the storm was going towards New Orleans. Being a kid who had seen quite a few hurricanes, I figured some stuff might get thrown around there would be some minor flooding in the streets (a common occurance) and we would get some time off school. I just saw the storm as free vacation time. I think as the storm got closer people started to get nervous, there was talk of the storm being bigger and more targeted than any other storm that NOLA had seen for years. But still, it seemed like that would just mean power might be out a bit longer, not a huge deal.  When the storm hit  Even once the storm made landfall, no one realized how bad it was going to be, it had clearly hit close, and there was flooding, but it wasn’t until the levees breached and the pumping stations shut down that things went truly south. We watched on TV as images came in of the city flooded with water. At that point no one was clear as to the level of destruction in any particular area. It would be some time until overhead flights would build a map allowing people to identify what had and had not been destroyed. It did however become clear that whether our house had or had not survived would not dictate whether or not the storm would effect us, this was a massive event that would effect everyone in a big way.  Living in Destin  Once it became clear that there would be no quick return to New Orleans we settled in as best as we could. We were already staying at a condo my grandmother owned at Hidden Dunes, so we continued to stay there. We found a school that would take us, Emerald Coast Middle School. Those guys deserve an award, and perhaps some day I will be able to donate back to them. Because of the massive displacement of people, most schools filled up immediately. ECM, which had just opened for the first time a few weeks earlier, took as many people as needed a place to go. Those of us who were displaced massively increased their population but they accommodated us. A number of my friends ended up in Destin and enrolled at ECM (Destin is a common vacation spot for New Orleanians). Compared to our school in New Orleans (Trinity) ECM was not academically rigorous, and for the most part we were bored. But it gave us something to do during the day and got us out of the house so our parents could do whatever they needed.  While we were staying in Destin, there was a huge outpouring of support from the community. Every church and community center had free meals for people to go to, not just for the food, but for the interaction. The Track (ammusement place) had free nights for evacuees and so on. I can’t say that I enjoyed living in Destin, but having friends and being in a place where the community supported us was awesome.  WWL and NOLA.com  A lot of credit has been given to two of the New Orleans media outlets, WWL 870FM and NOLA.com. I remember listening to WWL in the car (we could pick up a single) and reading on NOLA.com. I have to imagine that we would have listened to WWL online if we could, but we only had sporadic internet access through the computer at the resort office. It is hard to understand, but having information whether good, bad, or just there is really important in such situations. Those news outlets did incredible things to help save lives. For the rest of us, they just help keep us connected and moving forward.  Seeing the destruction  Seeing your home destroyed. With all of the people there suffering is difficult. Images like these are still upsetting to me:  Wandering  After a while my parents pulled us out of the local schools. We spent a few more weeks in Destin, where I mostly just went through an SAT book, then we went and visited my aunt Nati in Atlanta and my Uncle David in New Jersey. We looked for property in both places, but we all wanted to go back to New Orleans. So when the city was re-opened we moved back.  Moving back We were incredibly lucky with how well our house fared, and my father had gone back before us, and cleaned up somewhat. We had a pool that resembled a swamp, turtles and all. Our roof needed to be replaced, but other than that we were very fortunate to get by fine. Many of our friends in Metairie, uptown, the lakefront, etc. were not so lucky. I have some friends who took 16 feet of water for a month. Needless to say that sort of property was not restorable. The level of destruction across the city was unimaginable. Foundations with no houses, cars laying destroyed, bridges destroyed, etc… And everywhere there was flooding there was a somber reminder of the people who had died. During the search and rescue that followed the storm (for months after) crews going into houses would put a X on the front of every house with each quadrant holding a different piece of information: date, crew, hazards, and people found with a notation of dead or alive.  St. Truman’s  As people began to move back some schools tried to re-open. The independent schools did not have enough teachers or students to reopen on their own, so Trinity (my school), Newman, and St. George’s (not certain on the last one) banded together to make a school. I will say St. Truman’s was a lot of fun, we definitely had a good time.  The city rebuilding  As people began to move back into the city, there was tons of excitement that started to drown out some of the mourning. People were excited to rebuild the city, to have a chance to make it all it could be. There was also a lot of anger as the response to the storm continued to be a total mess.  Around the city, in addition to the destruction, there was so much trash. Almost everyone threw away their refrigerators (that adds up quick) and nearly any car left in the city was destroyed. On top of that, as people tried to rebuild, many houses had to be taken down to their frames. The most obvious place to see the trash was near the lakefront where there was a 24 hour operation hauling trash. A makeshift landfill was set up along the neutral grounds for miles with rows of trash multiple stories high. I remember our trash man, who drove around in a huge truck with a claw on an arm being very nice. We would give him food and soda when he came by to pick up the trash.  December after the storm we moved to uptown New Orleans, we considered leaving as so many did, but we wanted to be a part of New Orleans as it grew back to its former self and beyond. Unfortunately, after another year, it became clear that things were not going to go as we had hoped. We saw politicians failing to do the right thing again and again. We saw voters voting fools into office. And we saw that even once people had their houses and jobs back in order, their lives were still scrambled. As a result, during the summer almost two years after the storm we left the city.  That first Saints game back in the dome  First of all WHO DAT?!?!  The first game back in the Dome was incredible, and for some reason very meaningful. My mom was supposed to go with my dad, but at the last moment decided to let me go. The atmosphere was intense, we played the falcons, there were great bands playing outside, U2 and Green Day played inside. We crushed the Falcons. But most importantly people were back in the dome, and they weren’t there to to escape a storm, they weren’t starving and dying. We were there celebrating.  What was the affect on me? I was lucky, I didn’t live in the superdome, a hotel, or an attack after the storm. I didn’t lose every possession I had. And most importantly, no one that I love died. But none the less, the storm was still a very real event for me. At that age, change can be difficult and suddenly living in Destin was difficult. Not knowing whether our house had been destroyed and not fully understanding whether we could ever go back was very difficult. At the time, we had a weekend worth of clothes and really nothing to entertain us ,at the time that was a big deal. I actually have paper which I wrote about what I missed during Katrina, it gives some insight into how I was feeling at the time: What I Missed the Most About New Orleans  The real damage of the storm wouldn’t show itself until later. The stress caused by the storm inflicted a real toll on many adults, I suspect more so than their children. This led to illness and failed relationships everywhere I looked. I feel like the divorce rate skyrocketed. There was also an exodus from the city, the people who left took some of the life with them.  At the end of the day, I am stronger for the storm. I lived through some sort of traumatic event and I kept going. I didn’t have the worst of it and I was young with few responsibilities, but it forced me out of my shell and made me interested in politics. Hopefully, at the end of the day the city will look better than before too.  I have some papers that show how I was looking at the storm a few years later. I am confident that there are more somewhere, but I can’t seem to find them.  A Flood of Change (2009) A Flood of Change (2011) What went wrong? Katrina was not only a natural disaster, it was a man-made disaster. The preparation was awful. Then, the response was a complete mess until General Honore took over, that man was incredible. There was a sense of total ineptness on the part of the politicians, there still is. So many parts of the recovery just made no sense.  The levees  It is well understood that the levees failed because of massive design flaws and inadequate maintenance. Now I could understand if the government were to say “It isn’t our job to build you levees”, but the reality is that we paid them to do it, there were plenty of taxes paid to build that levee system, but the levees were a huge engineering failure. It boggles the mind that people didn’t realize how bad the design was, it seems that basic testing would have made it clear. The government should be held fully responsible for their inability to deliver on the levee design and construction.  The wetlands  Tropical storms get their power from warm water. When over land, their lack of an energy source and added friction against the ground causes them to loose strength. This means that the more land a storm travels over prior to hitting a city, the better. Originally Louisiana had more than enough land to help guard New Orleans against storms, however we have destroyed that land. The largest culprit here is the oil and gas industry. As the oil and gas industry built offshore oil drilling and pumping platforms, they obtained permits to cut through and dredge the wetlands. The permits required that they return and restore the wetlands once their contract was complete. They have never done so. The result is that the wetlands is criss-crossed with canals which allow salt water into the wetlands. That leads to death of the plant life and erosion of the land, allowing saltwater even further inland. In the end the result is massive loss of hurricane damping wetlands.  There are other culprits too. Someone had the Mississippi River Gulf Outlet (MRGO) built, which dug a huge trench through the wetlands and was virtually never used. There is also a huge issue of most sediment not getting through the dams on the north Mississippi. This robs the wetlands of the nutrient rich dirt needed to promote new growth.  At the end of the day, people who have damaged the wetlands need to fix them, but politicians are unwilling to hold their donors responsible. And it seems engineering fixes are few and far between.  Blue roofs  The blue roofs are a great example of pure idiocy. We had a blue roof put on, then eventually had our roof replaced. It took the crew that put on the blue roof longer than the crew that totally replaced the roof. When one looks at the numbers, the blue roofs cost nearly as much as just fixing the roofs properly, so why not just fix them? FAILURE  Fema trailers  Most people have heard of the mess that was the FEMA trailer program. The government spent a massive amount of money ordering trailers for people to live in temporarily, without a thought as to the quality of the trailers or how to deploy them. So the trailers were made unsafely and once delivered, FEMA had no way to get the trailers to the people that needed them. FAILURE  Why are there people who didn’t leave the city? People constantly talk about the people who didn’t leave the city in a negative light, like these people knew what was coming and just should have been left. First of all, no one knew what Katrina was going to do, had the levees not breached, it wouldn’t have been nearly as big of a deal. No one alive had experienced a hurricane so damaging. I would also love to know how people think the folks who didn’t evacuate should have left. Most of the people at the superdome got there via busses, they did not have cars. Of course the city could have used busses to take people elsewhere, but that is a failure on the part of the politicians, not the people directly.  On top of all of that, leaving was not easy, the roads were jammed beyond belief, fuel become scarce, and where do you go? Not everyone has family in a safe place, not everyone can rent a hotel room, and from prior experience, hotel rooms are not always easy to find.  I think we as a community should realize that those people being left in the city as long as they were was a failing on our part, not theirs.  Why even rebuild? I get asked and challenged about why we should rebuild New Orleans. People will say “you knew it was under water”, “why live in a place that is annually under threat of a storm”, etc… There are a few things wrong with this, the first is that there is no safe place. The west coast has earthquakes and drought, the Midwest has mild earthquakes, drought and tornados. The east coast has mild hurricanes, and in some places earthquakes. And the entire north has ice storms and blizzards. So to say that New Orleans in unreasonably unsafe is just silly. It is also important to understand that the gulf coast is home to a lot of people, exactly what would you like them to do, where should they go? There is also a very unique culture in New Orleans, which is worth preserving as well as a port which is still very productive.  What I will say is that rebuilding should be intelligent. Most of the problems presented by hurricanes can be engineered away. In the same way that San Francisco for example has tried to earthquake proof itself, New Orleans should try to hurricane proof itself. Some of this can be seen with new levees and flood walls, along with houses lifted on stilts and tall raised basements. There is much more to be done, and it should be done.  At the end of the day it comes down to an issue of money, who pays for rebuilding. I totally understand many people in other parts of the country not wanting to help, some should come from tax dollars, people of the gulf coast have paid taxes (for better or worse) and they should reap the rewards. The people who are responsible for the damage to the wetlands and the failure of the leaves should be held financially accountable at least in part for the damage they caused. And New Orleans needs to attract business, there is no way that I could get a job in New Orleans, that is a problem. New Orleans needs to expand its industry, it is a wonderful city and it needs to sell that to high paying employers so that people like me can go back and rebuild with our individual salaries.  Moving Forward Of course the city has made great progress, but there is a lot left to be done. The storm helped to shape who I am and made me better. Hopefully the same can be said for the city and country as a whole. Too many people died, too much was lost. We can hope that we have learned and that it will not happen again. We can hope that the city will be better in the end for all her residents who remain.  ", "author": "Michael Sobrepera"}